Revit 2027 API
BuiltInFailures.PathOfTravelFailures.UpdateSummary Property
 [Number] Path of Travel lines successfully updated. [Number] Path of Travel lines failed to update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UpdateSummary { get; }
Public Shared ReadOnly Property UpdateSummary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UpdateSummary {
	FailureDefinitionId^ get ();
}
static member UpdateSummary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PathOfTravelFailures Class
Autodesk.Revit.DB Namespace